cf/Documents/Акт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Акт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НедвижимостьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходныеМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/Акт/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.Акт.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.АдресНедвижимости,
	|	Акт.Дата,
	|	Акт.ИтоговаяСумма,
	|	Акт.Клиент,
	|	Акт.Клиент.Телефон как Телефон,
	|	Акт.Номер,
	|	Акт.ОтветственныйСотрудник,
	|	Акт.СписокУслуг.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		Стоимость
	|	),
	|	Акт.РасходныеМатериалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Акт КАК Акт
	|ГДЕ
	|	Акт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокУслугШапка = Макет.ПолучитьОбласть("СписокУслугШапка");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");
	ОбластьРасходныеМатериалыШапка = Макет.ПолучитьОбласть("РасходныеМатериалыШапка");
	ОбластьРасходныеМатериалы = Макет.ПолучитьОбласть("РасходныеМатериалы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокУслугШапка);
		ВыборкаСписокУслуг = Выборка.СписокУслуг.Выбрать();
		Пока ВыборкаСписокУслуг.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Заполнить(ВыборкаСписокУслуг);
			ТабДок.Вывести(ОбластьСписокУслуг, ВыборкаСписокУслуг.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьРасходныеМатериалыШапка);
		ВыборкаРасходныеМатериалы = Выборка.РасходныеМатериалы.Выбрать();
		Пока ВыборкаРасходныеМатериалы.Следующий() Цикл
			ОбластьРасходныеМатериалы.Параметры.Заполнить(ВыборкаРасходныеМатериалы);
			ТабДок.Вывести(ОбластьРасходныеМатериалы, ВыборкаРасходныеМатериалы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура Печать1(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать1)
	Макет = Документы.Акт.ПолучитьМакет("Печать1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.АдресНедвижимости,
	|	Акт.Дата,
	|	Акт.ИтоговаяСумма,
	|	Акт.Клиент,
	|	Акт.Номер,
	|	Акт.ОтветственныйСотрудник,
	|	Акт.СписокУслуг.(
	|		НомерСтроки,
	|		ВидРаботы,
	|		Стоимость
	|	),
	|	Акт.РасходныеМатериалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Цена,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.Акт КАК Акт
	|ГДЕ
	|	Акт.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокУслугШапка = Макет.ПолучитьОбласть("СписокУслугШапка");
	ОбластьСписокУслуг = Макет.ПолучитьОбласть("СписокУслуг");
	ОбластьРасходныеМатериалыШапка = Макет.ПолучитьОбласть("РасходныеМатериалыШапка");
	ОбластьРасходныеМатериалы = Макет.ПолучитьОбласть("РасходныеМатериалы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСписокУслугШапка);
		ВыборкаСписокУслуг = Выборка.СписокУслуг.Выбрать();
		Пока ВыборкаСписокУслуг.Следующий() Цикл
			ОбластьСписокУслуг.Параметры.Заполнить(ВыборкаСписокУслуг);
			ТабДок.Вывести(ОбластьСписокУслуг, ВыборкаСписокУслуг.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьРасходныеМатериалыШапка);
		ВыборкаРасходныеМатериалы = Выборка.РасходныеМатериалы.Выбрать();
		Пока ВыборкаРасходныеМатериалы.Следующий() Цикл
			ОбластьРасходныеМатериалы.Параметры.Заполнить(ВыборкаРасходныеМатериалы);
			ТабДок.Вывести(ОбластьРасходныеМатериалы, ВыборкаРасходныеМатериалы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
